In [1]:
import pandas as pd

In [2]:
pd

Series in pandas (1D)

In [3]:
s = pd.Series([25,4,5,32,5])

In [4]:
s

0    25
1     4
2     5
3    32
4     5
dtype: int64

In [5]:
s[0],s[3]

(25, 32)

In [6]:
s = pd.Series([25,4,5,32,5],index=["a","b","c","d","e"])

In [7]:
s

a    25
b     4
c     5
d    32
e     5
dtype: int64

In [8]:
s[::2]

a    25
c     5
e     5
dtype: int64

In [9]:
s = pd.Series([25,4,5,32,5],dtype="float64")

In [10]:
s

0    25.0
1     4.0
2     5.0
3    32.0
4     5.0
dtype: float64

In [11]:
s.max()

32.0

In [12]:
s.mean()

14.2

Dataframe (collection of series aka 1d data)

In [13]:
df = pd.DataFrame([[2,2,53,3,5],[3,3,4,55,0],[33,77,2,181,1111]])

In [14]:
df

    0   1   2    3     4
0   2   2  53    3     5
1   3   3   4   55     0
2  33  77   2  181  1111

In [15]:
df[0]

0     2
1     3
2    33
Name: 0, dtype: int64

In [16]:
df[1]

0     2
1     3
2    77
Name: 1, dtype: int64

In [17]:
df[0][1]

3

In [18]:
df[[0]]

    0
0   2
1   3
2  33

In [19]:
type(df[0])

pandas.core.series.Series

type(df[[0]])

In [21]:
df[0:1]

   0  1   2  3  4
0  2  2  53  3  5

In [25]:
x= pd.Series([1,2,3,4,5],index=["a","b","c","d","e"])

In [26]:
x

a    1
b    2
c    3
d    4
e    5
dtype: int64

Dictionary

In [31]:
y = pd.Series({
    "a":1,
    "b":2,
    "c":3,
    "d":4,
    "e":5
})

In [32]:
y

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [33]:
y["a"]

1

In [38]:
info = pd.DataFrame({
    "name":["aaa","bbb","ccc","ddd","eee","fff","ggg","hhh","iii","jjj"],
    "rn":[1,2,3,4,5,6,7,8,9,10],
    "sub":["maths","english","hindi","python","dms","sc","maths","dld","stats","ai"]
})

In [39]:
info

  name  rn      sub
0  aaa   1    maths
1  bbb   2  english
2  ccc   3    hindi
3  ddd   4   python
4  eee   5      dms
5  fff   6       sc
6  ggg   7    maths
7  hhh   8      dld
8  iii   9    stats
9  jjj  10       ai

In [41]:
info["rn"][7]

8

In [42]:
info["rn"][7] = 28

/tmp/ipykernel_6475/1377184844.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  info["rn"][7] = 28

In [43]:
info

  name  rn      sub
0  aaa   1    maths
1  bbb   2  english
2  ccc   3    hindi
3  ddd   4   python
4  eee   5      dms
5  fff   6       sc
6  ggg   7    maths
7  hhh  28      dld
8  iii   9    stats
9  jjj  10       ai

In [45]:
info.max()

name      jjj
rn         28
sub     stats
dtype: object

In [46]:
info.tail(2)

  name  rn    sub
8  iii   9  stats
9  jjj  10     ai

In [47]:
info.head(4)

  name  rn      sub
0  aaa   1    maths
1  bbb   2  english
2  ccc   3    hindi
3  ddd   4   python

In [48]:
info

  name  rn      sub
0  aaa   1    maths
1  bbb   2  english
2  ccc   3    hindi
3  ddd   4   python
4  eee   5      dms
5  fff   6       sc
6  ggg   7    maths
7  hhh  28      dld
8  iii   9    stats
9  jjj  10       ai

In [49]:
info["rn"]

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7    28
8     9
9    10
Name: rn, dtype: int64

In [50]:
info["rn"].mean()

7.5